Конфигурация/src/Documents/ЗакрытиеМесяца/ЗакрытиеМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеМесяца</name>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
</mdclass:Document>

Конфигурация/src/AccountingRegisters/РегистрБухУчет/РегистрБухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухУчет</name>
  <chartOfAccounts>ChartOfAccounts.БухУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Конфигурация/src/ChartsOfAccounts/БухУчет/БухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухУчет</name>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41       </code>
    </items>
    <items>
      <name>РасчетыСПоставщиками</name>
      <description>Расчеты с поставщиками</description>
      <code>60       </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Себестоимость</description>
      <code>90.1     </code>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Расчеты с покупателями</description>
      <code>62       </code>
    </items>
    <items>
      <name>Выручка</name>
      <description>Выручка</description>
      <code>90.2     </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50       </code>
    </items>
    <items>
      <name>РасчетныеСчета</name>
      <description>Расчетные счета</description>
      <code>51       </code>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>99       </code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

Конфигурация/src/Documents/ЗакрытиеМесяца/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрБухУчетОстатки.Счет,
		|	РегистрБухУчетОстатки.СуммаОстатокДт,
		|	РегистрБухУчетОстатки.СуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.РегистрБухУчет.Остатки(&МоментВремени, Счет В (&СчетВыручка, &СчетСебестоимость),) КАК
		|		РегистрБухУчетОстатки";
	
	Запрос.УстановитьПараметр("СчетВыручка", ПланыСчетов.БухУчет.Выручка);
	Запрос.УстановитьПараметр("МоментВремени", КонецМесяца(Дата)+1);
	Запрос.УстановитьПараметр("СчетСебестоимость", ПланыСчетов.БухУчет.Себестоимость);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаВыручки = 0;
	СуммаСебестоимости = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.БухУчет.Выручка Тогда
			СуммаВыручки = ВыборкаДетальныеЗаписи.СуммаОстатокКт;
		ИначеЕсли ВыборкаДетальныеЗаписи.Счет = ПланыСчетов.БухУчет.Себестоимость Тогда
			СуммаСебестоимости = ВыборкаДетальныеЗаписи.СуммаОстатокДт;
			конецЕсли;
		
	КонецЦикла;
	
	движения.РегистрБухУчет.Записывать = Истина;
	Проводка = движения.РегистрБухУчет.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = планыСчетов.БухУчет.Выручка;
	Проводка.СчетКт = планыСчетов.БухУчет.ПрибылиИУбытки;
	Проводка.Сумма = суммаВыручки;
	
	движения.РегистрБухУчет.Записывать = Истина;
	Проводка = движения.РегистрБухУчет.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = планыСчетов.БухУчет.ПрибылиИУбытки;
	Проводка.СчетКт = планыСчетов.БухУчет.Себестоимость;
	Проводка.Сумма = суммаСебестоимости;
КонецПроцедуры
